Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: This is all what is needed for an endpoint like this one to return the currently authenticated user's profile with `GET http://localhost:8080/github/userinfo` and access it as the individual `UserInfo` properties:
ja_jp: このようなエンドポイントに必要なことは、現在認証されているユーザーのプロファイルを `GET http://localhost:8080/github/userinfo` で返し、それを個々の `UserInfo` プロパティーとしてアクセスすることです。

source: This is all what is needed for an endpoint like this one to return the currently-authenticated user's profile with `GET http://localhost:8080/github/userinfo` and access it as the individual `UserInfo` properties:
ja_jp: このようなエンドポイントに対して必要なのは、現在認証されているユーザーのプロファイルを `GET http://localhost:8080/github/userinfo` で返却し、個々の `UserInfo` のプロパティとしてアクセスすることです:

source: This is all you have to do update the already resolved dynamic tenantr configuration, without having to reconnect to the provider.
ja_jp: プロバイダーに再接続することなく、すでに解決された動的テナント設定を更新するために必要なことはこれだけです。

source: This is also valid for `Optional` and friends:
ja_jp: これは `Optional` と friends にも有効です。

source: This is also validated.
ja_jp: これも検証されています。

source: This is an Alpha release and there are some known limitations:
ja_jp: これはアルファリリースであり、いくつかの既知の制限があります。

source: This is an additional feature of https://github.com/smallrye/smallrye-fault-tolerance/[SmallRye Fault Tolerance] and is not specified by MicroProfile Fault Tolerance.
ja_jp: これは https://github.com/smallrye/smallrye-fault-tolerance/[SmallRye Fault Tolerance] の追加機能であり、MicroProfile Fault Tolerance では指定されていません。

source: This is an advanced section that only needs to be read by users who have developed custom extensions that depend on JAX-RS and / or REST Client functionality.
ja_jp: このセクションは、JAX-RSおよび/またはRESTクライアントの機能に依存するカスタムエクステンションを開発したユーザのみが読む必要がある高度なセクションです。

source: This is an advanced section that only needs to be read by users who have developed custom extensions that depend on Jakarta REST and / or REST Client functionality.
ja_jp: このセクションは、Jakarta RESTおよび/またはREST Client機能に依存するカスタムエクステンションを開発したユーザーだけが読む必要のある高度なセクションです。

source: This is an alpha quality feature, so please try it out and if you have any feedback let us know on the mailing list, and file a GitHub issue for any problems you encounter.
ja_jp: これはアルファ・フェーズの機能であり、是非試して、何かフィードバックがあればメーリングリストでお知らせください、何か問題が発生した場合はGitHub に課題登録ください。

source: This is an easy way to show a toast message. The toast can be placed on the screen (default left bottom) and can have a level (Info, Success, Warning, Error). Any of the levels can also be primary, which will create a more prominent toast message.
ja_jp: これは容易にトーストメッセージを表示できる方法です。トーストは画面上に配置でき (デフォルトでは左下)、レベル (Info、Success、Warning、Error) を設定できます。いずれかのレベルを primary にすることで、目を引くトーストメッセージを作成できます。

source: This is an example command to deploy your `BackgroundFunction` to Google Cloud, as the function is triggered by a Storage event, it needs to use `--trigger-event google.storage.object.finalize` and the `--trigger-resource` parameter with the name of a previously created bucket:
ja_jp: これは `BackgroundFunction` を Google Cloud にデプロイするためのコマンドの例です。この関数は Storage イベントによってトリガーされるため、 `--trigger-event google.storage.object.finalize` と `--trigger-resource` パラメーターに先の手順で作成したバケットの名前を指定する必要があります。

source: This is an example command to deploy your `CloudEventsFunction` to Google Cloud, as the function is triggered by a Storage event, it needs to use `--trigger-bucket` parameter with the name of a previously created bucket:
ja_jp: これは `CloudEventsFunction` を Google Cloud にデプロイするコマンドの例です。この関数は Storage イベントをトリガーとしているので、 `--trigger-bucket` パラメータにあらかじめ作成した Bucket 名を指定しておく必要があります。

source: This is an example command to deploy your `HttpFunction` to Google Cloud:
ja_jp: これは `HttpFunction` を Google Cloud にデプロイするためのコマンドの例です。

source: This is an example command to deploy your `RawBackgroundFunction` to Google Cloud, as the function is triggered by a PubSub event, it needs to use `--trigger-event google.pubsub.topic.publish` and the `--trigger-resource` parameter with the name of a previously created topic:
ja_jp: これは `RawBackgroundFunction` を Google Cloud にデプロイするコマンドの例です。この関数は PubSub イベントによってトリガーされるので、 `--trigger-event google.pubsub.topic.publish` と `--trigger-resource` パラメーターに、先の手順で作成したトピックの名前を指定する必要があります。

source: This is an example of when the status is `DOWN`:
ja_jp: これは、ステータスが `DOWN` になった場合の例です:

source: This is an extremely serious issue so we urge anyone who has already upgraded to 2.10.x and is exposing GraphQL services to upgrade to 2.10.3.Final.
ja_jp: これは非常に深刻な問題ですので、すでに 2.10.x にアップグレードして GraphQL サービスを公開している方は、2.10.3.Final にアップグレードすることを強くお勧めします。

source: This is an important milestone: 3.32 marks the feature freeze for our next LTS release, Quarkus 3.33 LTS. The upcoming LTS will be branched from the 3.32 line, making this release the foundation on which 3.33 LTS will be built.
ja_jp: これは重要なマイルストーンです。3.32 は、次期 LTS リリースである Quarkus 3.33 LTS の機能凍結を示します。今後の LTS は 3.32 ラインから分岐され、このリリースが 3.33 LTS が構築される基盤となります。

source: This is an in-depth documentation, see the xref:building-my-first-extension.adoc[building my first extension] if you need an introduction, or the xref:extension-faq.adoc[frequently asked questions].
ja_jp: これは詳細なドキュメントです。概要または xref:extension-faq.adoc[よくある質問] については、 xref:building-my-first-extension.adoc[初めてのエクステンションの作成] を参照してください。

source: This is an in-depth documentation, see the xref:building-my-first-extension.adoc[building my first extension] if you need an introduction.
ja_jp: これは詳細なドキュメントです。入門書が必要な場合は、 link:building-my-first-extension.html[初めてのエクステンションの作成]をご覧ください。

source: This is an interceptor binding annotation that is used to bind our interceptor to a bean. Simply annotate a bean class with `@Logged`.
ja_jp: これは、インターセプターをBeanにバインドするために使用されるインターセプターバインディングアノテーションです。Beanクラスに `@Logged` をアノテーションします。

source: This is an interceptor binding annotation. In this case, the annotation comes from Micrometer. The relevant interceptor intercepts the invocation and updates the relevant metrics. We will talk about <<interceptors,interceptors>> later.
ja_jp: これはインターセプターのバインディングアノテーションです。このケースでは、アノテーションは Micrometer に由来します。関連するインターセプターは呼び出しをインターセプトし、関連するメトリクスを更新します。 <<interceptors,インターセプター>>については後述します。

source: This is an interceptor binding annotation. In this case, the annotation comes from the MicroProfile Metrics. The relevant interceptor intercepts the invocation and updates the relevant metrics. We will talk about <<interceptors,interceptors>> later.
ja_jp: これはインターセプター結合アノテーションです。この場合、アノテーションは MicroProfile Metrics から来ています。関連するインターセプターは呼び出しをインターセプトし、関連するメトリクスを更新します。 <<interceptors,インターセプター>>については後述します。

source: This is an interceptor binding annotation. In this case, the annotation comes from the MicroProfile Metrics. The relevant interceptor intercepts the invocation and updates the relevant metrics. We will talk about xref:interceptors[interceptors] later.
ja_jp: これは、インターセプターのバインディングアノテーションです。このケースではアノテーションは MicroProfile Metrics から来ています。関連するインターセプターは、呼び出しをインターセプトして、関連するメトリクスを更新します。 xref:interceptors[インターセプター] については、後で説明します。

source: This is an interceptor binding annotation. See the following examples for how it's used.
ja_jp: これは、インターセプター バインディング アノテーションです。 使用方法については、次の例を参照してください。

source: This is an introduction to writing JSON REST services with Quarkus. A more detailed guide about Quarkus REST (formerly RESTEasy Reactive) is available xref:rest.adoc[here].
ja_jp: QuarkusでJSON RESTサービスを記述する方法を紹介します。 Quarkus REST（旧RESTEasy Reactive）のより詳細なガイドは xref:rest.adoc[こちら] をご覧ください。

source: This is an introduction to writing JSON REST services with Quarkus. A more detailed guide about RESTEasy Reactive is available xref:resteasy-reactive.adoc[here].
ja_jp: Quarkusを使用してJSON RESTサービスを記述するための入門書です。RESTEasy Reactiveに関するより詳細なガイドは、 link:resteasy-reactive.html[こちら] をご覧ください。

source: This is application dependant and cannot really be shared in the library itself
ja_jp: これはアプリケーションに依存しており、ライブラリ自体で共有することはできません。

source: This is application dependent and cannot really be shared in the library itself
ja_jp: これはアプリケーションに依存しており、ライブラリ自体で共有することはできません。

source: This is because Hibernate ORM may generate SQL that is invalid for versions of the database older than what is configured, which would lead to runtime exceptions.
ja_jp: これは、Hibernate ORMが、設定されているものより古いバージョンのデータベースに対して無効なSQLを生成し、実行時例外が発生する可能性があるためです。

source: This is because `gdb` is not aware of the location of the source files. We are running the executable outside of the target directory. To fix this we can either rerun `gdb` from the target directory or, run `directory target/debugging-native-1.0.0-SNAPSHOT-native-image-source-jar/sources` e.g.:
ja_jp: これは、 `gdb` がソースファイルの場所を認識していないことが原因です。実行可能ファイルは、ターゲットディレクトリーの外で実行しています。これを修正するには、ターゲットディレクトリーから `gdb` を再実行するか、 `directory target/debugging-native-1.0.0-SNAPSHOT-native-image-source-jar/sources` を実行します。以下に例を示します。

source: This is because `gdb` is not aware of the location of the source files. We are running the executable outside the target directory. To fix this we can either rerun `gdb` from the target directory or, run `directory target/debugging-native-1.0.0-SNAPSHOT-native-image-source-jar/sources` e.g.:
ja_jp: これは、 `gdb` がソースファイルの場所を認識していないことが原因です。実行可能ファイルは、ターゲットディレクトリーの外で実行しています。これを修正するには、ターゲットディレクトリーから `gdb` を再実行するか、 `directory target/debugging-native-1.0.0-SNAPSHOT-native-image-source-jar/sources` を実行します。以下に例を示します。

source: This is because we didn’t compile the Quarkus application with `-Dquarkus.native.debug.enabled`, so `gdb` cannot find debugging symbols for our native executable, as indicated by the "_No debugging symbols found in ./target/debugging-native-1.0.0-SNAPSHOT-runner_" message in the beginning of `gdb`.
ja_jp: これは、Quarkus アプリケーションを `-Dquarkus.native.debug.enabled` でコンパイルしなかったことが原因で、これにより、 `gdb` の最初にある "_No debugging symbols found in ./target/debugging-native-1.0.0-SNAPSHOT-runner_" メッセージで示されているように、 `gdb` はネイティブ実行可能ファイルのデバッグシンボルを見つけることができません。

source: This is best shown by the following image:
ja_jp: これを最もよく表しているのは、以下の画像です。

source: This is both practical and effective: you already write integration tests to validate your application, and they also happen to produce somewhat realistic training data for the AOT cache.
ja_jp: これは実用的かつ効果的です。あなたはすでにアプリケーションを検証するために統合テストを作成しており、それらはAOTキャッシュ用の比較的現実的なトレーニングデータも生成します。

source: This is configured using the `commit-strategy` attribute:
ja_jp: これは `commit-strategy` 属性を使用して設定します:

source: This is considered an advanced option and should only be performed if you fully understand the consequences of changing the scope of the bean.
ja_jp: これは高度なオプションと見なされ、Bean のスコープを変更することで引き起こされる結果を完全に理解している場合にのみ実行する必要があります。

source: This is convenient, but what if you'd prefer the database to always have content? That would make testing easier. If you provide an `import.sql` file, Quarkus will use that to initialise the database on each start.
ja_jp: これは便利ですが、データベースに常にコンテンツが保存されている方がよい場合はどうすればよいですか? そうすればテストが簡単になります。 `import.sql` ファイルを提供すると、Quarkus はそれを使用して、 毎回の起動時にデータベースを初期化します。

source: This is covered in the xref:building-native-image.adoc[Native Executable Guide].
ja_jp: これについては、xref:building-native-image.adoc[ネイティブ実行可能ファイルガイド] で説明されています。

source: This is currently not supported in Quarkus. Configuration example for traces: `quarkus.otel.tracing.exporter=otlp`.
ja_jp: これは現在、Quarkus ではサポートされていません。トレースの設定例: `quarkus.otel.tracing.exporter=otlp`。

source: This is described in a dedicated guide for Avro: xref:kafka-schema-registry-avro.adoc[Using Apache Kafka with Schema Registry and Avro]. And a different one for JSON Schema: xref:kafka-schema-registry-json-schema.adoc[Using Apache Kafka with Schema Registry and JSON Schema].
ja_jp: これについては、Avro 専用のガイド xref:kafka-schema-registry-avro.adoc[Schema Registry と Avro と共に Apache Kafka を使用する] で説明されています。 JSON スキーマの場合は xref:kafka-schema-registry-json-schema.adoc[Schema Registry と JSON Schem と共に Apache Kafka を使用する] を参照してください。

source: This is described in a dedicated guide: xref:kafka-schema-registry-avro.adoc[Using Apache Kafka with Schema Registry and Avro].
ja_jp: これは、専用ガイド xref:kafka-schema-registry-avro.adoc[Schema RegistryとAvroと共にApache Kafkaを使用] で説明されています。

source: This is described in a dedicated guide: xref:kafka-schema-registry-json-schema.adoc[Using Apache Kafka with Schema Registry and JSON Schema].
ja_jp: これについては、専用のガイド xref:kafka-schema-registry-json-schema.adoc[スキーマレジストリーと JSON スキーマと共に Apache Kafka を使用する] で説明されています。

source: This is described in a dedicated guide: xref:kafka-streams.adoc[Using Apache Kafka Streams].
ja_jp: 詳細は、専用ガイドの xref:kafka-streams.adoc[Apache Kafka Streamsの使用] で説明されています。

source: This is done by annotating a method with `@OnOpen` or `@OnClose`:
ja_jp: これは、メソッドに `@OnOpen` または `@OnClose` アノテーションを付けることで行われます。

source: This is done by configuring the following properties:
ja_jp: これは、以下のプロパティーを設定することで行います。

source: This is done in the `src/main/resources/application.properties` file.
ja_jp: これは、 `src/main/resources/application.properties` ファイルで行います。

source: This is done via a pluggable system of link:{jaxrsapi}/jakarta/ws/rs/ext/MessageBodyReader.html[`MessageBodyReader`] and link:{jaxrsapi}/jakarta/ws/rs/ext/MessageBodyWriter.html[`MessageBodyWriter`] interfaces, which are responsible for defining which Java type they map from/to, for which media types, and how they turn HTTP bodies to/from Java instances of that type.
ja_jp: これは、link:{jaxrsapi}/jakarta/ws/rs/ext/MessageBodyReader.html[`MessageBodyReader`] および link:{jaxrsapi}/jakarta/ws/rs/ext/MessageBodyWriter.html[`MessageBodyWriter`] インターフェイスのプラグ可能なシステムを介して行われます。 これらは、どの Java 型から/にマッピングするか、どのメディア型にマッピングするか、 HTTP 本文をそのタイプの Java インスタンスにどのように変換するか、そのタイプの Java インスタンスから HTTP 本文をどのように変換するかを定義します。

source: This is done via a pluggable system of link:{jaxrsapi}/javax/ws/rs/ext/MessageBodyReader.html[`MessageBodyReader`] and link:{jaxrsapi}/javax/ws/rs/ext/MessageBodyWriter.html[`MessageBodyWriter`] interfaces, which are responsible for defining which Java type they map from/to, for which media types, and how they turn HTTP bodies to/from Java instances of that type.
ja_jp: これは、link:{jaxrsapi}/javax/ws/rs/ext/MessageBodyReader.html[`MessageBodyReader`] と link:{jaxrsapi}/javax/ws/rs/ext/MessageBodyWriter.html[`MessageBodyWriter`] インターフェイスのプラグインシステムによって行われ、どの Java タイプからどのメディアタイプへマッピングするか、またそのタイプの Java インスタンスとどのように HTTP 本文をやり取りするかを定義する役割を持っています。

source: This is due to the logging implementation not being included in the native executable. Using the JBoss Logging adapters will solve this problem.
ja_jp: これは、ロギングの実装がネイティブ実行可能ファイルに含まれていないことが原因です。JBoss Logging アダプターを使用することで、この問題は解決されます。

source: This is effectively the same as running the `HelloWorldMain` application main directly, but has the advantage it can be run from the IDE.
ja_jp: これは `HelloWorldMain` アプリケーション mainを直接実行するのと実質的には同じですが、IDE から実行できるという利点があります。

source: This is enabled by default, and can be disabled via `quarkus.test.only-test-application-module=true`.
ja_jp: これはデフォルトで有効になっており、 `quarkus.test.only-test-application-module=true` で無効にすることができます。

source: This is enough to generate a basic OpenAPI schema document from your REST Endpoints:
ja_jp: これだけでRESTエンドポイントから基本的なOpenAPIスキーマドキュメントを生成するのには十分です:

source: This is enough to generate a basic OpenAPI schema document from your Vert.x Routes:
ja_jp: これだけで、Vert.x ルートから基本的な OpenAPI スキーマドキュメントを生成できます。

source: This is especially important when building a native executable as we need to make sure the OpenTracing JDBC driver has been registered for reflection, together with the underlying JDBC driver.
ja_jp: これはネイティブ実行可能ファイルをビルドする際に特に重要で、OpenTracing JDBCドライバが、基盤となるJDBCドライバとともに、リフレクション用に登録されていることを確認する必要があるからです。

source: This is especially important when building native executables as you could encounter issues similar to the following when compiling the native executable:
ja_jp: ネイティブ実行可能ファイルをコンパイルする際に以下のような問題が発生する可能性があるため、ネイティブ実行可能ファイルをビルドする際には特に重要です。

source: This is especially important when building native executables, as you could encounter issues similar to the following when compiling the native executable:
ja_jp: これはネイティブ実行可能ファイルをビルドする際に特に重要です。 ネイティブ実行可能ファイルをコンパイルする際に、以下のような問題が発生する可能性があるからです：

source: This is especially useful if the exception occurred outside a visible page or during startup. The assistant will analyze the error and suggest potential causes or fixes — without needing to navigate elsewhere.
ja_jp: これは、表示されているページ以外や起動時に例外が発生した場合に特に便利です。アシスタントはエラーを分析し、他の場所に移動することなく、潜在的な原因や修正方法を提案します。

source: This is handy to debug flaky tests that happen only in the CI environment, in particular, as this will only increase the verbosity of logs in the particular test where the option is enabled.
ja_jp: これは、特に CI 環境でのみ発生する不安定なテストをデバッグする場合に便利です。 このオプションが有効になっている特定のテストのみでログの詳細度が増加するためです。

source: This is handy to debug flaky tests that happen only in the CI environment, in particular; for example the GitHub Actions CI at https://github.com/quarkusio/quarkus/ is set up so that such `target/debug` directories are collected into build artifacts available for download after each CI run.
ja_jp: これは、特に CI 環境でのみ発生する不安定なテストをデバッグする場合に便利です。 たとえば、 https://github.com/quarkusio/quarkus/ の GitHub Actions CI では、このような `target/debug` ディレクトリーが収集され、各 CI 実行後にダウンロード可能なビルドアーティファクトとして提供されるようにセットアップされています。

source: This is happening because from a `perf` perspective, each thread is a different command. We can see that if we inspect `perf report`:
ja_jp: これは、 `perf` の観点から見ると、各スレッドが異なるコマンドであるために起こっています。 `perf report` を確認するとわかります。

source: This is happening because the default worker thread pool is coming from Vert.x which guards against threads being blocked for far too long.
ja_jp: これは、デフォルトのワーカースレッドプールがVert.xから来たもので、スレッドがあまりにも長くブロックされるのを防ぐためです。

source: This is helpful for both Java developers who are used to working with the imperative model and don’t want to switch things up, and those working with a cloud-native/reactive approach. The Quarkus development model can adapt itself to whatever app you’re developing.
ja_jp: これは、命令型モデルでの作業に慣れていて切り替えたくない Java 開発者と、クラウドネイティブ/リアクティブなアプローチで作業する開発者の両方に役立ちます。Quarkus 開発モデルは、開発しているどんなアプリにも適応できます。

source: This is how Quarkus OIDC resolves static custom tenants if no custom `TenantResolver` is registered.
ja_jp: これは、カスタム `TenantResolver` が登録されていない場合に、Quarkus OIDC が静的カスタムテナントを解決する方法です。

source: This is how interceptors are used. What about creating an interceptor?
ja_jp: ここまで、インターセプタ―がどのように使用されるかを説明しました。では、インターセプターを作成するにはどうすれば良いでしょうか。

source: This is how the above flamegraph shows a total of 72 calls to `__GI___mmap64` for the thread name abbreviation stack trace, given that Quarkus native executable runs 18 threads.
ja_jp: このように、上記のフレームグラフでは、合計72回もの呼び出しを `_GI_ _mmap64` Quarkusのネイティブ実行可能ファイルが18スレッドで実行されていることを考えると、スレッド名の省略形スタックトレースで使用されます。

source: This is how the specification-defined properties are mapped to the Quarkus-native configuration:
ja_jp: 仕様定義のプロパティーが Quarkus ネイティブ設定にマッピングされる方法は次のとおりです。

source: This is important and has been present in the generated projects for quite some time. Add it if not already there.
ja_jp: これは重要であり、生成されたプロジェクトにはかなり前から存在しています。まだ存在しない場合は追加してください。

source: This is in particular useful when you want an application to be able to use one of a pre-determined set of datasources at runtime.
ja_jp: これは特に、アプリケーションの実行時に、あらかじめ決められたデータソースのうちの1つを使用できるようにしたい場合に便利です。

source: This is in particular useful when you want an application to be able to xref:datasource.adoc#datasource-active[use one of a pre-determined set of datasources at runtime].
ja_jp: これは特に、アプリケーションが xref:datasource.adoc#datasource-active[実行時に事前に決められたデータソースのセットの中から 1 つを使用] できるようにしたい場合に便利です。

source: This is is another configuration that was not previously possible. We can individually move configurable non-application endpoints to a specified absolute path, specifically `/metrics` and `/liveness` in this example:
ja_jp: これは、以前は不可能だったもう一つの設定です。設定可能なアプリケーション以外のエンドポイントを、指定された絶対パスに個別に移動させることができます。特にこの例では `/metrics` と `/liveness` に移動させることが出来ます:

source: This is needed if you are not using xref:redis-dev-services.adoc[Dev Services for Redis]
ja_jp: これは、 link:redis-dev-services.html[Dev Services for Redis]を使用していない場合に必要です。

source: This is not directly related to testing, but allows you to toggle instrumentation based reload. This will allow live reload to avoid a restart if a change does not affect the structure of a class, which gives a faster reload and allows you to keep state.
ja_jp: これはテストとは直接関係ありませんが、インスツルメンテーションベースのリロードを切り替えることができます。これにより、クラスの構造に影響を与えない変更の場合、再起動を避けるためにライブリロードが可能になり、リロードが速くなり、状態を維持することができます。

source: This is not directly related to testing, but allows you to turn live reload on and off.
ja_jp: これはテストとは直接関係ありませんが、ライブリロードのオン/オフを切り替えることができます。

source: This is not needed for libraries that are dependencies of a Quarkus extension as the extension will take care of this for you.
ja_jp: これは、Quarkusエクステンションの依存関係にあるライブラリには必要ありません。

source: This is only enabled if the `quarkus.webauthn.enable-login-endpoint` configuration is set to `true`.
ja_jp: これは、 `quarkus.webauthn.enable-login-endpoint` 設定が `true` に設定されている場合にのみ有効になります。

source: This is only enabled if the `quarkus.webauthn.enable-registration-endpoint` configuration is set to `true`.
ja_jp: これは、 `quarkus.webauthn.enable-registration-endpoint` 設定が `true` に設定されている場合にのみ有効になります。

source: This is only needed if you are using Failsafe to run integration tests
ja_jp: これは、Failsafeを使って統合テストを実行する場合にのみ必要です。

source: This is only to allow Quarkus to determine the Hibernate ORM dialect to use; see <<hibernate-dialect-varying-database,this section>> for details.
ja_jp: これは、Quarkus が使用する Hibernate ORM のダイアレクトを決定できるようにすることのみを目的としています。 詳細は、<<hibernate-dialect-varying-database,this section>> を参照してください。

source: This is optional.
ja_jp: これはオプションです。

source: This is particularly useful if multiple test methods must use the same set of security settings.
ja_jp: これは、複数のテスト方法で同じセキュリティー設定セットを使用する必要がある場合に特に便利です。

source: This is particularly useful if the same set of security settings needs to be used in multiple test methods.
ja_jp: これは、同じセキュリティ設定のセットを複数のテストメソッドで使用する必要がある場合に特に便利です。

source: This is really a simple rule that marks a person who is older than 18 years as an adult.
ja_jp: これは本当にシンプルなルールで、18歳以上の人を大人としてマークしています。

source: This is really a simple rule that marks a person who is older that 18 years as an adult.
ja_jp: これは本当にシンプルなルールで、18歳以上の人を大人としてマークしています。

source: This is required on any method which interacts with the database, in order to run the operations in a transaction.
ja_jp: これは、トランザクション内で操作を実行するために、データベースと対話するすべてのメソッドで必要です。

source: This is similar to the previous expression with the difference being that the method parameter must be different from the logged-in username.
ja_jp: これは前の式と似ていますが、メソッドパラメーターがログインしているユーザー名とは異なる必要があるという違いがあります。

source: This is similar to the previous expression with the difference being that the method parameter must be different than the logged in username.
ja_jp: これは前の式と似ていますが、メソッドパラメーターがログインしているユーザー名とは異なる必要があるという違いがあります。

source: This is simple, include the generated documentation in your guide:
ja_jp: これは簡単で、ガイドで生成されたドキュメントを含めます。

source: This is solved by using `~` as a `null` key to represent any YAML property that is a prefix of another one:
ja_jp: これは `~` を `null` キーとして使い、他のプロパティのプレフィックスである YAML プロパティを表すことで解決されます：

source: This is solved by using a `null` key (represented by `~`) for any YAML property which is a prefix of another one:
ja_jp: これは、別のプロパティのプレフィックスであるYAMLプロパティに `null` キー（ `~` で表される）を使用することで解決します。

source: This is standard Google Cloud Function implementation, nothing fancy here except that it receives a `io.cloudevents.CloudEvent`.
ja_jp: これは標準的な Google Cloud Function の実装であり、 `io.cloudevents.CloudEvent` を受け取る以外は何も派手なことはしていません。

source: This is standard Google Cloud Function implementation, nothing fancy here.
ja_jp: これは標準的な Google Cloud Function の実装であり、ここでは何も派手なことはしていません。
